In [1]:
import pandas as pd

In [2]:
india_weather = pd.DataFrame({
    "city":["mumbai","delhi","bangalore"],
    "temperature":[32,45,30],
    "humidity":[80,60,78]
})

india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [3]:
us_weather = pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "temperature":[68,65,75],
    "humidity":[21,14,35]
})

us_weather

       city  temperature  humidity
0  new york           68        21
1   chicago           65        14
2   orlando           75        35

In [6]:
df = pd.concat([india_weather,us_weather],ignore_index=True)
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
3   new york           68        21
4    chicago           65        14
5    orlando           75        35

What is **"keys"?** pass **keys** to concat() function

In [7]:
df = pd.concat([india_weather,us_weather], keys=["india","us"])
df

              city  temperature  humidity
india 0     mumbai           32        80
      1      delhi           45        60
      2  bangalore           30        78
us    0   new york           68        21
      1    chicago           65        14
      2    orlando           75        35

Now we got additional index.

In [8]:
df.loc["india"]

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [9]:
temperature_df = pd.DataFrame({
     "city":["mumbai","delhi","bangalore"],
    "temperature":[32,45,30]
})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [10]:
windspeed_df = pd.DataFrame({
    "city":["mumbai","delhi","bangalore"],
    "windspeed":[69,80,23]
})
windspeed_df

        city  windspeed
0     mumbai         69
1      delhi         80
2  bangalore         23

Now we have 2 data frame and we want to concat it by column. If we simply give concat function let's see what happens

In [12]:
new_df = pd.concat([temperature_df,windspeed_df])
new_df

        city  temperature  windspeed
0     mumbai         32.0        NaN
1      delhi         45.0        NaN
2  bangalore         30.0        NaN
0     mumbai          NaN       69.0
1      delhi          NaN       80.0
2  bangalore          NaN       23.0

We can see that the second dataframe values are appended to the first. Row wise.

To make it column wise we'll specify the parameter axis = 1

In [13]:
new_df = pd.concat([temperature_df,windspeed_df],axis=1)
new_df

        city  temperature       city  windspeed
0     mumbai           32     mumbai         69
1      delhi           45      delhi         80
2  bangalore           30  bangalore         23

What if one data frame contains 3 rows and second data frame contains 2?

In [16]:
temperature_df = pd.DataFrame({
     "city":["mumbai","delhi","bangalore"],
    "temperature":[32,45,30]
},index=([1,2,3]))
temperature_df

        city  temperature
1     mumbai           32
2      delhi           45
3  bangalore           30

In [17]:
windspeed_df = pd.DataFrame({
    "city":["mumbai","delhi"],
    "windspeed":[69,80]
},index=([1,2]))
windspeed_df

     city  windspeed
1  mumbai         69
2   delhi         80

In [18]:
df = pd.concat([temperature_df,windspeed_df],axis=1)

In [19]:
df

        city  temperature    city  windspeed
1     mumbai           32  mumbai       69.0
2      delhi           45   delhi       80.0
3  bangalore           30     NaN        NaN

When we provided axis explicitly we can see the dataframes are concated successfully

In [20]:
s = pd.Series(["Humid","Dry","Rain"],name='event')
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

I'm going to concat this pandas series to the temperature dataframe

In [23]:
df = pd.concat([temperature_df,s],axis=1)

In [24]:
df

        city  temperature  event
1     mumbai         32.0    Dry
2      delhi         45.0   Rain
3  bangalore         30.0    NaN
0        NaN          NaN  Humid